:PROPERTIES:
:ID: 8ebac1d6-a7e8-4556-a483-a1b1c11f832d
:END:
#+TITLE: Pandoc

[[file:..][..]]

https://pandoc.org/ |
https://github.com/jgm/pandoc/

#+begin_quote
Pandoc dubs itself a "markup format" converter.
It can take a document in one of the supported formats and convert only its markup to another format.
Maintaining the look and feel of the document is not a priority.
#+end_quote

* 2023-03-09
** I may have found a bug in Pandoc
No link in pandoc:

#+begin_src shell :results output raw
cat <<EOF | pandoc --from org --to json
visa writes in [[id:7d7ef8e9-9312-4cbe-9fc9-12ff7bda489b][visakanv's 50yr "plan" for global nerd network [wip]​]]:
EOF
#+end_src

#+RESULTS:
{"pandoc-api-version":[1,23],"meta":{},"blocks":[{"t":"Para","c":[{"t":"Str","c":"visa"},{"t":"Space"},{"t":"Str","c":"writes"},{"t":"Space"},{"t":"Str","c":"in"},{"t":"Space"},{"t":"Str","c":"[[id:7d7ef8e9-9312-4cbe-9fc9-12ff7bda489b][visakanv's"},{"t":"Space"},{"t":"Str","c":"50yr"},{"t":"Space"},{"t":"Str","c":"\"plan\""},{"t":"Space"},{"t":"Str","c":"for"},{"t":"Space"},{"t":"Str","c":"global"},{"t":"Space"},{"t":"Str","c":"nerd"},{"t":"Space"},{"t":"Str","c":"network"},{"t":"Space"},{"t":"Str","c":"[wip]​]]:"}]}]}

Simplified, still no link:

#+begin_src shell :results raw
echo "#+begin_src json"
cat <<EOF | pandoc --from org --to json
visa writes in [[id:abc123][xx "plan" xx [wip]​]]:
EOF
echo "#+end_src"
#+end_src

#+RESULTS:
#+begin_src json
{"pandoc-api-version":[1,23],"meta":{},"blocks":[{"t":"Para","c":[{"t":"Str","c":"visa"},{"t":"Space"},{"t":"Str","c":"writes"},{"t":"Space"},{"t":"Str","c":"in"},{"t":"Space"},{"t":"Str","c":"[[id:abc123][xx"},{"t":"Space"},{"t":"Str","c":"\"plan\""},{"t":"Space"},{"t":"Str","c":"xx"},{"t":"Space"},{"t":"Str","c":"[wip]​]]:"}]}]}
#+end_src

Removing quotations, what now?

#+begin_src shell :results raw
echo "#+begin_src json"
cat <<EOF | pandoc --from org --to json
visa writes in [[id:abc123][xx [wip]​]]:
EOF
echo "#+end_src"
#+end_src

#+RESULTS:
#+begin_src json
{"pandoc-api-version":[1,23],"meta":{},"blocks":[{"t":"Para","c":[{"t":"Str","c":"visa"},{"t":"Space"},{"t":"Str","c":"writes"},{"t":"Space"},{"t":"Str","c":"in"},{"t":"Space"},{"t":"Str","c":"[[id:abc123][xx"},{"t":"Space"},{"t":"Str","c":"[wip]​]]:"}]}]}
#+end_src

No link.

Removing wip with brackets, what now?

#+begin_src shell :results raw
echo "#+begin_src json"
cat <<EOF | pandoc --from org --to json
visa writes in [[id:abc123][xx wip​]]:
EOF
echo "#+end_src"
#+end_src

#+RESULTS:
#+begin_src json
{"pandoc-api-version":[1,23],"meta":{},"blocks":[{"t":"Para","c":[{"t":"Str","c":"visa"},{"t":"Space"},{"t":"Str","c":"writes"},{"t":"Space"},{"t":"Str","c":"in"},{"t":"Space"},{"t":"Link","c":[["",[],[]],[{"t":"Str","c":"xx"},{"t":"Space"},{"t":"Str","c":"wip​"}],["id:abc123",""]]},{"t":"Str","c":":"}]}]}
#+end_src

It's a link!
🎉
